; domain
(define (domain blocks)
    (:requirements :strips :negative-preconditions :adl)
    (:predicates
        (hand-full)
        (in-state ?x)
        (next ?x ?y)
    )

    (:action pick
        :parameters ()
        :precondition (not (hand-full))
        :effect (hand-full)
    )

    (:action place
        :parameters ()
        :precondition (hand-full)
        :effect (and
            (not (hand-full))
            (forall (?s1 ?s2)
                (when (and (in-state ?s1) (next ?s1 ?s2))
                (and (not (in-state ?s1)) (in-state ?s2)))
            )
        )
    )
)

; problem
(define (problem stack_3_blocks)
    (:domain blocks)
    (:requirements :strips)
  	(:objects stack1 stack2 stack3 stack4)
    (:init
        (in-state stack1)
        (next stack1 stack2)
        (next stack2 stack3)
        (next stack3 stack4)
    )
    (:goal (and
        (in-state stack4)
      )
    )
)

; plan
1. (pick)
   added: (hand-full)
   goals met: 0 of 1
2. (place)
   deleted: (hand-full) (in-state stack1)
   added: (in-state stack2)
   goals met: 0 of 1
3. (pick)
   added: (hand-full)
   goals met: 0 of 1
4. (place)
   deleted: (hand-full) (in-state stack2)
   added: (in-state stack3)
   goals met: 0 of 1
5. (pick)
   added: (hand-full)
   goals met: 0 of 1
6. (place)
   deleted: (hand-full) (in-state stack3)
   added: (in-state stack4)
   goals met: 1 of 1
